In [3]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
df = DataFrame({'k1':['X','X','Y','Y','Z'],
               'k2': ['alpha','beta','alpha','beta','alpha'],
               'ds1':np.random.randn(5),
               'ds2':np.random.randn(5)})

df

  k1     k2       ds1       ds2
0  X  alpha  0.469778 -0.084170
1  X   beta  0.766179  1.041545
2  Y  alpha  1.097562  1.163514
3  Y   beta -0.433773 -0.135686
4  Z  alpha  0.419774  0.079754

In [5]:
group1 = df['ds1'].groupby(df['k1'])

group1

In [6]:
group1.mean()

k1
X    0.617978
Y    0.331895
Z    0.419774
Name: ds1, dtype: float64

In [7]:
city = np.array(['London','Lahore','Lahore','London','Lahore'])

month = np.array(['Jan','Feb','Jan','Feb','Jan'])

In [8]:
df['ds1'].groupby([city,month]).mean()

Lahore  Feb    0.766179
        Jan    0.758668
London  Feb   -0.433773
        Jan    0.469778
Name: ds1, dtype: float64

In [9]:
df

  k1     k2       ds1       ds2
0  X  alpha  0.469778 -0.084170
1  X   beta  0.766179  1.041545
2  Y  alpha  1.097562  1.163514
3  Y   beta -0.433773 -0.135686
4  Z  alpha  0.419774  0.079754

In [10]:
df.groupby(['k1','k2']).mean()

               ds1       ds2
k1 k2
X  alpha  0.469778 -0.084170
   beta   0.766179  1.041545
Y  alpha  1.097562  1.163514
   beta  -0.433773 -0.135686
Z  alpha  0.419774  0.079754

In [11]:
df.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [12]:
for name, group1 in df.groupby('k1'):              
    print ("This is the %s group" %name)
    print (group1)
    print ('\n')

This is the X group
  k1     k2       ds1       ds2
0  X  alpha  0.469778 -0.084170
1  X   beta  0.766179  1.041545


This is the Y group
  k1     k2       ds1       ds2
2  Y  alpha  1.097562  1.163514
3  Y   beta -0.433773 -0.135686


This is the Z group
  k1     k2       ds1       ds2
4  Z  alpha  0.419774  0.079754

In [13]:
for (k1, k2), group in df.groupby(['k1', 'k2']):
    print ("Key1 = %s Key2 = %s" %(k1,k2))
    print (group1)
    print ('\n')

Key1 = X Key2 = alpha
  k1     k2       ds1       ds2
4  Z  alpha  0.419774  0.079754


Key1 = X Key2 = beta
  k1     k2       ds1       ds2
4  Z  alpha  0.419774  0.079754


Key1 = Y Key2 = alpha
  k1     k2       ds1       ds2
4  Z  alpha  0.419774  0.079754


Key1 = Y Key2 = beta
  k1     k2       ds1       ds2
4  Z  alpha  0.419774  0.079754


Key1 = Z Key2 = alpha
  k1     k2       ds1       ds2
4  Z  alpha  0.419774  0.079754

In [15]:
group_dict = dict(list(df.groupby('k1')))

group_dict['X']

  k1     k2       ds1       ds2
0  X  alpha  0.469778 -0.084170
1  X   beta  0.766179  1.041545

In [16]:
group_dict_axis1 = dict(list(df.groupby(df.dtypes,axis=1)))

group_dict_axis1

{dtype('float64'):         ds1       ds2
 0  0.469778 -0.084170
 1  0.766179  1.041545
 2  1.097562  1.163514
 3 -0.433773 -0.135686
 4  0.419774  0.079754,
 dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [18]:
dataset2_group = df.groupby(['k1', 'k2'])[['ds2']]

dataset2_group.mean()

               ds2
k1 k2
X  alpha -0.084170
   beta   1.041545
Y  alpha  1.163514
   beta  -0.135686
Z  alpha  0.079754